[
  {
    "text": "When we started from zero, people said:\n‘Play the algorithm. Chase views.’\n\nWe stuck with chasing values.\n\nWhen we hit 100K, people said:\n‘Follow trends. Do what’s viral.’\n\nWe stuck with educating people.\n\nAt 1 million, they said:\n‘Sensationalise. Make noise.’\n\nWe stuck with making sense.\n\nAt 10 million, people said:\n‘Create drama. That’s what sells.’\n\nWe stuck with creating dreams.\n\nFrom day one, we didn’t pick the easy path.\nWe picked the one that felt right.\n\nAnd that’s why you, our audience, stuck with us.\nBecause what we built was never just a podcast.\nIt was a shared dream.\n\nI learn to figure out life. And you learn with me.\n\nAnd that story of building ambitions, chasing dreams, is why we’re announcing this partnership with ASUS as their brand ambassador.\n\nWe are coming together because we believe in making you realise the ambition inside you.\n\nWe have always believed in chasing your dreams, and ASUS helps in providing those tools that can help people turn their dreams into results.\n\nIt’s not just a partnership, it’s a shared commitment to empower Indian professionals and entrepreneurs.",
    "engagement": 4641,
    "line_count": 24,
    "language": "English",
    "tags": [
      "Entrepreneurship",
      "Motivation"
    ]
  },
  {
    "text": "What is that one thing you want to change about yourself to get better? And why?",
    "engagement": 2226,
    "line_count": 1,
    "language": "English",
    "tags": [
      "Personal Growth",
      "Mindset"
    ]
  },
  {
    "text": "You can’t always see leadership qualities in how people work.  Sometimes they come out in different settings. \n\nSo a few weeks back, the whole Figuring Out team went to Lonavala for an offsite. \n\nWe had sessions and activities for self-reflection, goal alignment, and what’s in store for the future of Figuring Out. \n\nAnd we also had games, team bonding activities, and just a whole lot of fun. \n\nThe whole team was divided into 4 teams. \nAnd each team had a leader, a cool name, and a song. \n(my team’s name was Hunters, please don’t ask why or how)\n\nThere were a variety of tasks that each team had to do to win points.  A dance competition, cricket, artistic games, and more.\n\nI noticed how every single task brought out a new kind of leader.\n\nOne person owned the choreography.\nAnother stepped up for captaincy in cricket.\nSomeone else took the pen during creative tasks.\n\nNo one was told to lead. No one was ‘assigned’ a role.\nThey just did it. Naturally. Quietly. Confidently.\n\nIt made me realise how their leadership qualities came out in different settings. \n\nThey may not have shown the same in the office. \nDifferent personalities shine in different situations.",
    "engagement": 17002,
    "line_count": 24,
    "language": "English",
    "tags": [
      "Leadership"
    ]
  },
  {
    "text": "A lot of you might disagree with me on this, but talent is overrated. \n\nIt’s not all that you make it seem.\n\nYou see someone doing better than you and immediately go,\n‘They’re just more talented than me.’ \nAnd maybe they are.\n\nBut that’s not the problem. The real problem is you think that’s the end of the story.\n\nIt’s not.\n\nYou can outwork someone more talented. It’ll be harder, sure.\nYou’ll probably have to put in 3x the effort. Maybe more.\nBut it’s doable. And in the long run, it won’t even matter.\n\nBecause when you’re consistent, when you keep showing up, keep getting better, keep putting in the hours, you build something meaningful, and then talent or not, it makes no difference.\n\nIf you’ve been outworking everyone from day one, you’ve already built the muscle for it.\n\nYou know how to take hits and keep going. That’s what actually takes you far.\n\nIt’s not sexy. It’s not glamorous.\nBut it works.\n\nYou don’t need to be the most gifted in the room. You just need to be the one who doesn’t stop",
    "engagement": 9090,
    "line_count": 24,
    "language": "English",
    "tags": [
      "Motivation",
      "Productivity"
    ]
  },
  {
    "text": "I’ve said this at least 10 times on the podcast,\n\nI’m obsessed with human psychology.\n\nWhy people do what they do. What drives them.\nWhat they don’t even realise they’re doing.\nIt fascinates me. Every single time.\n\nAnd the thing is, it really helps you in business.\nIf you understand what people want and why they want it, you figure out how to give it to them.\n\nEven the daily behaviours teach you something or the other. \nThere’s always a pattern. A reason. A story behind the action",
    "engagement": 1594,
    "line_count": 9,
    "language": "English",
    "tags": [
      "Mindset",
      "Business"
    ]
  },
  {
    "text": "‘Balance’ is one of the biggest lies sold to our generation.\n\nEveryone’s trying to give 50-50 to everything: work, relationships, health, fun. And then wondering why nothing’s actually moving.\n\nIt doesn’t work like that.\nYou don’t build anything meaningful by dividing your energy equally every day.\n\nYou prioritise. You maximise.\nOne thing at a time.\n\nIf work needs you right now, go all in.\nBe obsessed. Work like a maniac.\nDon’t guilt yourself over it.\n\nBut if your relationships are falling apart and that matters to you, then yes, take a little step back from the hustle. Fix it. Also, no guilt.\n\nBalance isn’t 50-50. \nBalance isn’t about splitting everything evenly.\n\nIt’s about knowing what matters most right now and giving it your all.\n\nThen once that’s stable, you optimise the rest.\n\nThe reason most people feel burnt out and stuck is that they are trying to be everything, everywhere, all at once.\n\nPick what matters.\nMax it out. Then move.",
    "engagement": 6110,
    "line_count": 24,
    "language": "English",
    "tags": [
      "Productivity",
      "Personal Growth"
    ]
  },
  {
    "text": "If your own work doesn’t make you respect yourself,\nnothing anyone says about you will ever feel enough.\n\nBecause deep down, you’ll know.\nYou’ll know you’re not working the way you say you are.\n\nA lot of people talk big about ambition, goals, building something massive. But when you look at their actions the work doesn’t match the volume of their voice.\n\nAnd that gap creates self-doubt, inferiority, insecurities.\nThen it doesn’t matter how much external validation you get.\nCompliments, praise, likes, followers, it all feels fake.\n\nBecause when you don’t respect your own work, no amount of praise will fix that.\n\nYou know you’re not actually doing the hard part.\nAnd that eats at you. Quietly. Constantly.\n\nYou’ll start to feel small in front of people.\nYou’ll question yourself in every room.\n\nSelf-respect isn’t just a mindset.\nIt’s based on evidence.\n\nYou earn it by doing what you said you would do.\nBy becoming the person your words claim to be.\n\nAnd if you keep skipping that part, you’re never going to feel good enough.",
    "engagement": 3090,
    "line_count": 24,
    "language": "English",
    "tags": [
      "Motivation",
      "Personal Growth"
    ]
  },
  {
    "text": "I work like there’s no tomorrow. I have an urgency to do stuff. \n\nBut not everyone works like me. \nNot everyone should.\n\nYou can’t judge everyone by your pace, your methods, or your goals.\n\nYou can’t have the same bar for everyone.\nYou can’t see them with the same lens.\n\nOne person might be going for speed.\nAnother for balance.\nOne is chasing freedom.\nAnother is feeding a family.\n\nContext changes everything. \n\nSo before you label someone as lazy, slow, or lacking ambition, know their goals, personal problems, and circumstances. \n\nAsk yourself if you’re seeing the full picture.\nChances are, you’re not.\n\nNot everyone’s playing the same game.\n\nRespect that and you’ll waste a lot less time judging people who were never supposed to move like you in the first place.",
    "engagement": 6657,
    "line_count": 24,
    "language": "English",
    "tags": [
      "Leadership",
      "Mindset"
    ]
  },
  {
    "text": "I don’t need to win at everything. And I’m okay with that.\n\nYou can dress better than me. Write better than me.\nBe better at socialising, marketing, whatever.\n\nThat doesn’t bother me.\nBecause I know what game I’m playing.\n\nWhen it comes to my work, my podcast, my content, the things I’m building every day, that’s where I won't let myself lose.\n\nThat’s the space I’m willing to outwork anyone.\n\nPeople will always be better than you at something.\nLet them.\n\nYou don’t have to win at everything.\nYou just have to make sure no one can beat you at your thing.\n\nBe okay with losing 99 battles if it means you win the one that actually matters to you.",
    "engagement": 4807,
    "line_count": 17,
    "language": "English",
    "tags": [
      "Mindset",
      "Productivity"
    ]
  },
  {
    "text": "In a startup, your oldest people should get the first shot at leadership.\n\nThey were there when no one knew the brand.\nWhen things were messy, uncertain, and unglamorous.\n\nThey’ve seen how things were built.\nThey’ve made decisions when there were no playbooks.\n\nThey didn’t just do their job, they built the job with you.\nAnd they know the business inside out.\n\nSo when a leadership role opens up, they deserve the first opportunity.\n\nYou give them a chance to step up.\nAnd if they can handle it, great. \nThey grow with the company.\n\nBut if they can’t, and that will happen too, you do what’s needed.\nYou bring in someone who can take things forward. \nBecause the business has to grow, no matter what.\n\nBut it’s on you to give people who helped build your business a fair chance to grow with it.",
    "engagement": 7403,
    "line_count": 17,
    "language": "English",
    "tags": [
      "Leadership",
      "Entrepreneurship"
    ]
  },
  {
    "text": "Founders are losing in the business game because they are so busy making everyone around them happy.\n\nPeople-pleasing is one of the most dangerous habits I’ve seen in founders, business owners.\n\nAnd they hide it behind the excuse of being ‘democratic.’\n\nDemocracy does not mean you have to make every person happy. \n\nIt means that the majority is aligned, and you keep moving.\n\nThe moment you start listening to every opinion, suggestion, or complaint, you lose speed, things become unclear, and your leadership is questioned. \n\nAt the start, speed is everything.\nAnd if every decision needs to make everyone happy, you’ll never be able to move forward. \n\nDemocracy can help your business, but people pleasing will only damage it.",
    "engagement": 2229,
    "line_count": 9,
    "language": "English",
    "tags": [
      "Leadership",
      "Entrepreneurship"
    ]
  },
  {
    "text": "If you can’t control your emotions, people will control you. Always.\n\nPeople lose business, relationships, and respect just because they couldn’t control a reaction in one heated moment.\n\nIt’s easy to react.\nTo snap. To argue. To prove a point.\n\nBut every time you react without thinking, you hand over control to the other person, the situation, the chaos.\n\nThe most dangerous people are the ones who stay calm even when disrespected.\n\nPower is not in being the loudest in the room. \nIt’s in knowing you could respond, but choosing not to. \n\nWhy do you have the need to prove anything to anyone?\nBe clear on what deserves your energy and what doesn’t.\n\nWhen you don’t react, people stop trying to control you.\nYou stop playing their game.",
    "engagement": 10060,
    "line_count": 12,
    "language": "English",
    "tags": [
      "Mindset",
      "Leadership"
    ]
  },
  {
    "text": "This is why you are not able to get success quickly-\n\nEveryone wants success right now.\nNo one wants to grind for years.\n\nIt’s always, ‘What’s the shortcut?’ ‘What’s the hack?’\n\nLook, there’s no substitute for work.\nYour work ethic should match the ambition that comes out of your mouth.\n\nIt’s easy to say you want to build something big.\nTo talk about goals, vision, and success.\n\nBut big dreams don’t mean sh*t without big discipline.\n\nYou don’t get what you want.\nYou get what you’re willing to show up for, every single day.\n\nNo shortcuts. No hacks. Just showing up.\n\nThat’s the only thing that separates those who make it and those who don’t",
    "engagement": 4517,
    "line_count": 15,
    "language": "English",
    "tags": [
      "Motivation",
      "Productivity"
    ]
  },
  {
    "text": "Startups don’t die because they run out of money.\nThey die because they try to do too much.\n\nFounders think they need to chase every shiny thing.\nNew features. New markets. New partnerships.\n\nBut you can’t win 10 races at once.\nYou’ll just lose all of them.\n\nAmazon sold only books for 2 years.\nInstagram was just photo filters when it launched.\n\nEvery great company started by doing one boring thing obsessively well.\n\nFocus is how you earn the right to grow.\n\nDo the one thing that’ll actually move the needle.\nKill the rest",
    "engagement": 7413,
    "line_count": 11,
    "language": "English",
    "tags": [
      "Entrepreneurship",
      "Productivity"
    ]
  },
  {
    "text": "You’re not burnt out because you’re tired.\nYou’re burnt out because you’re bored.\n\nBurnout doesn’t happen after a long day of doing something you love.\n\nThat’s just you being exhausted. \nYou rest, and the next day you're back at it.\n\nReal burnout happens when you’re stuck doing things you didn’t want to do in the first place.\n\nThings that don’t excite you.\nThings that don’t appeal to you.\nMeetings you didn't need to be in.\nEmails that didn't need you to be looped in. \nSitting on a chair all day and working because you have to.\n\nThat’s what drains you.\nNot creating. Not building. Not solving.\n\nSome people work long hours and still show up excited the next morning. And some work 2 hours and feel dead inside. \n\nThe difference is not the hours. It’s the purpose behind them.\n\nIf you’re feeling burnt out, ask yourself:\nIs this actually hard work? Or is this just work I don't like?\n\nBurnout isn’t about doing too much.\nIt’s about doing too little of what actually matters.",
    "engagement": 6724,
    "line_count": 24,
    "language": "English",
    "tags": [
      "Motivation",
      "Productivity"
    ]
  },
  {
    "text": "Most founders are control freaks.\nThat’s why their company never grows beyond them.\n\nIn the beginning, you do everything: sales, content, hiring, even packing boxes if you have to.\n\nBut if you're still doing it all after a couple of years, you’re not building a business. You’re just building yourself a job.\n\nDelegation feels scary because you think no one can do it like you.\n \nLook, you won't know how to do everything. You hire people because they can do it better.\n\nYou bring in people with sharper skills, different perspectives, and ideas you’d never think of.\n\nAnd that’s what actually pushes the business forward.\n\nThe faster you learn to let go, the faster your company learns to grow.",
    "engagement": 14216,
    "line_count": 11,
    "language": "English",
    "tags": [
      "Entrepreneurship",
      "Leadership"
    ]
  },
  {
    "text": "I don’t have a college degree. \n\nDid I drop out? \nWhat happened? \nWhy didn’t I complete it?\n\nThat’s a story for another time. \nFor now, I don’t have a degree, and I don’t check if my team does either. \n\nYesterday, I was talking to a couple of people from my team, and the topic of college came up. That’s when it hit me how little importance we give to formal education. \n\nWe check what you can do and your attitude towards learning.\nWe want pure skill and hunger to learn, that’s it.\n\nI’m not saying you should drop out or not go for that master’s, but that is not the only way to do things. \n\nTechnology has advanced so much, you have the world at your fingertips. \n\nInstead of sitting around and waiting for someone to come and teach you what you want to do in life, learn to take things into your own hands. \n\nYes, do go to college. \nBut it’s not the college’s responsibility to make a career for you.\n\nYou need to upskill yourself.",
    "engagement": 5015,
    "line_count": 24,
    "language": "English",
    "tags": [
      "Entrepreneurship",
      "Personal Growth"
    ]
  },
  {
    "text": "If you want to make a lot of money, you’ll have to compromise your morals.\n\nThis is something I used to believe when I was a little kid. \n\nYou know how the saying goes, \n'Paise kam hain, par chain ki neend hai.'\n(Money might be less, but at least I sleep peacefully.)\n\nBecause it was assumed that rich people had gained all that success and wealth by shortcuts and wrongdoings.\n\nBut I was so wrong. \n\nThe more I worked, the more I realised you don’t have to bend your morals to win.\n\nYou can play fair.\nStick to your values.\nStay within the system.\nAnd still get everything you have ever wanted.\n\nAll it takes is unshakable belief, hard work, the right team, and just a little bit of luck. \n\nDon’t go the wrong way when you can get everything by staying on the right path. \n\nYes, it’ll take a little extra work and time, but at least 'chain ki neend' won’t be compromised.",
    "engagement": 4027,
    "line_count": 17,
    "language": "Hinglish",
    "tags": [
      "Motivation",
      "Personal Growth"
    ]
  },
  {
    "text": "You know how you feel defeated when failure hits you? \nWell, it’s the best thing that can happen to you. \n\nThis is not some ‘you learn from your failures’ bullsh*t. \nYou do learn, but learning isn’t exclusive to failing.\n\nWhen you do something and succeed, you set a benchmark. \n\nNow, to anything to work for you, it either reaches that benchmark or goes beyond. \n\nAnd because you know it worked, you will be scared to change even a little thing.\n\nCopy and paste becomes the norm. \n\nFailure, on the other hand, works the opposite. \nYou fail, fail, fail and then anything, even with a little bit of improvement, will work. \n\nYou don’t have a set mould. There are no expectations. \nYou have the freedom to go do whatever you want and watch it work for you. \n\nIt gives you wings to explore. \nDo things you couldn’t when the benchmark held you back from experimenting.",
    "engagement": 3311,
    "line_count": 17,
    "language": "English",
    "tags": [
      "Entrepreneurship",
      "Motivation"
    ]
  },
  {
    "text": "I’ve never liked reading. Still don’t.\n\nBut I read every single day.\nBecause I’m curious, I want to learn.\n\nBecause there’s too much stuff in the world that you can never get enough of. \n\nLook, nobody likes doing the boring stuff. \nEveryone wants to be smart, successful, ahead of the game.\n\nBut no one wants to do the hard, slow stuff that gets you there.\n\nReading isn’t glamorous.\nBut it’s the most boring habits that create long-term success.\n\nYou don’t read one book and suddenly know it all.\nYou read one, and it shows you how much you don’t know.\n\nThen you read more books, articles, blogs, whatever you can find.\n\nThere’s too much happening in the world.\nToo many smart people outworking, outlearning, outpacing you.\n\nAnd if you’re not growing, you’re falling behind. \nSilently. Slowly. Then suddenly.\n\nFrom the outside, success looks effortless.\nBut in reality, it’s just a bunch of ordinary habits repeated daily.",
    "engagement": 4933,
    "line_count": 20,
    "language": "English",
    "tags": [
      "Personal Growth",
      "Productivity"
    ]
  }
]